# Advanced Dataframes Exercises

### Create a function named get_db_url. 
It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [27]:
import pandas as pd
import numpy as np

In [28]:
from env import host, user, password

In [29]:
def get_db_url(host, user, password, database):
        
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    
    return url

In [31]:
get_db_url(host, user, password, 'employees')

'mysql+pymysql://germain_1473:z5xiaRMKpZ6xRIiK5m9ZPhpgMj1v8T75@157.230.209.171/employees'

In [32]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', get_db_url(host,user, password, 'employees'))

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [33]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', get_db_url(host,user, password, 'employees'))

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

### Read the employees and titles tables into two separate DataFrames.

In [71]:
employees = pd.read_sql('SELECT * FROM employees', get_db_url(host,user, password, 'employees'))

In [72]:
type(employees)

pandas.core.frame.DataFrame

In [73]:
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [74]:
titles = pd.read_sql('SELECT * FROM titles', get_db_url(host,user, password, 'employees'))

In [75]:
type(titles)

pandas.core.frame.DataFrame

In [76]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

### How many rows and columns do you have in each DataFrame? Is that what you expected?

In [77]:
employees.shape

(300024, 6)

In [78]:
titles.shape

(443308, 4)

### Display the summary statistics for each DataFrame.

In [79]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [80]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

### How many unique titles are in the titles DataFrame?

In [81]:
unique_values =  pd.unique(titles['title'])

print(unique_values, len(unique_values))

['Senior Engineer' 'Staff' 'Engineer' 'Senior Staff' 'Assistant Engineer'
 'Technique Leader' 'Manager'] 7

In [91]:
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [92]:
len(titles.title.value_counts())

7

### What is the oldest date in the to_date column?

In [89]:
titles.to_date.min()

#titles['to_date'] = pd.to_datetime(titles['to_date'], format='%Y-%m-%d')

datetime.date(1985, 3, 1)

In [94]:
titles.to_date.sort_values(ascending=True).head(1)

16064    1985-03-01
Name: to_date, dtype: object

### What is the most recent date in the to_date column?

In [90]:
titles.to_date.max()

datetime.date(9999, 1, 1)

In [93]:
titles.to_date.sort_values(ascending=False).head(1)

0    9999-01-01
Name: to_date, dtype: object

In [85]:
titles.sort_values(by = 'to_date').tail(1)

        emp_no     title   from_date     to_date
443307  499999  Engineer  1997-11-30  9999-01-01